Revit 2024 API
UnderlayOrientation Enumeration
 Indicates how elements in the underlay are viewed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum UnderlayOrientation
Visual Basic
Public Enumeration UnderlayOrientation
Visual C++
public enum class UnderlayOrientation
Members
Member name | Description
LookingDown |  Underlay elements are viewed as if looking down from above.
LookingUp |  Underlay elements are viewed as if looking up from below.
See Also
Autodesk.Revit.DB Namespace